---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeleteEditedElement
source: html/5fec5682-5cf0-bf52-cbbb-ef244c529dee.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeleteEditedElement Property

Can't delete element that is being edited.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDeleteEditedElement { get; }
```